r1, r2, i1, r3, i2, i3, i4, r4, i5, i6, i7, i8, i9, i10, i11 = map(int,input('Введите 15 бит без пробелов\n'))
s1 = (i1+i2+i4+i5+i7+i9+i11+r1)%2
s2 = (r2+i1+i3+i4+i6+i7+i10+i11)%2
s3 = (r3+i2+i3+i4+i8+i9+i10+i11)%2
s4 = (r4+i5+i6+i7+i8+i9+i10+i11)%2
d = {(0, 0, 0, 0): lambda:print(f'Нет ошибок, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 0, 0, 1): lambda:print(f'Ошибка в r1, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 0, 1, 0): lambda:print(f'Ошибка в r2, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 0, 1, 1): lambda:print(f'Ошибка в i1, правильное сообщение {(i1+1)%2},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 1, 0, 0): lambda:print(f'Ошибка в r3, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 1, 0, 1): lambda:print(f'Ошибка в i2, правильное сообщение {i1},{(i2+1)%2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 1, 1, 0): lambda:print(f'Ошибка в i3, правильное сообщение {i1},{i2},{(i3+1)%2},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (0, 1, 1, 1): lambda:print(f'Ошибка в i4, правильное сообщение {i1},{i2},{i3},{(i4+1)%2},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (1, 0, 0, 0): lambda:print(f'Ошибка в r4, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (1, 0, 0, 1): lambda:print(f'Ошибка в i5, правильное сообщение {i1},{i2},{i3},{i4},{(i5+1)%2},{i6},{i7},{i8},{i9},{i10},{i11}'),
     (1, 0, 1, 0): lambda:print(f'Ошибка в i6, правильное сообщение {i1},{i2},{i3},{i4},{i5},{(i6+1)%2},{i7},{i8},{i9},{i10},{i11}'),
     (1, 0, 1, 1): lambda:print(f'Ошибка в i7, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{(i7+1)%2},{i8},{i9},{i10},{i11}'),
     (1, 1, 0, 0): lambda:print(f'Ошибка в i8, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{(i8+1)%2},{i9},{i10},{i11}'),
     (1, 1, 0, 1): lambda:print(f'Ошибка в i9, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{(i9+1)%2},{i10},{i11}'),
     (1, 1, 1, 0): lambda:print(f'Ошибка в i10, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{(i10+1)%2},{i11}'),
     (1, 1, 1, 1): lambda:print(f'Ошибка в i11, правильное сообщение {i1},{i2},{i3},{i4},{i5},{i6},{i7},{i8},{i9},{i10},{(i11+1)%2}')}
d[(s4,s3,s2,s1)]()

